<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"85b58ebc6cc43d143aa34ab18eec733965ae779471b6ab5798da3361d8a804f7","plan_job_ref":"Job Create Terraform plan (DEV) #172 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15199016391","plan_out_hash":"5bc1dfc3624087d3204eb1f5fc696a34326fa3ac3db2b2af89cc3e361145866e","plan_hash":"cd27da094a46b125ec699395f1decd4237ce3288c016ed8048c599314109a686","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 4 to add, 2 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.ESOFederatedIdentity will be destroyed
  # (because azurerm_federated_identity_credential.ESOFederatedIdentity is not in configuration)
-   resource "azurerm_federated_identity_credential" "ESOFederatedIdentity" {
-       audience            = [
-           "api://AzureADTokenExchange",
        ] -> null
-       id                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openmrs-dev-audioprothese-aks-agentpool/federatedIdentityCredentials/ESOFederatedIdentity" -> null
-       issuer              = "https://francecentral.oic.prod-aks.azure.com/b7b023b8-7c32-4c02-92a6-c8cdaa1d189c/c5b1dcf1-e75e-4f17-85d9-51be638c58e3/" -> null
-       name                = "ESOFederatedIdentity" -> null
-       parent_id           = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openmrs-dev-audioprothese-aks-agentpool" -> null
-       resource_group_name = "MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral" -> null
-       subject             = "system:serviceaccount:eso:workload-identity-sa" -> null
    }

  # azurerm_federated_identity_credential.eso_federated_identity will be created
+   resource "azurerm_federated_identity_credential" "eso_federated_identity" {
+       audience            = [
+           "api://AzureADTokenExchange",
        ]
+       id                  = (known after apply)
+       issuer              = "https://francecentral.oic.prod-aks.azure.com/b7b023b8-7c32-4c02-92a6-c8cdaa1d189c/c5b1dcf1-e75e-4f17-85d9-51be638c58e3/"
+       name                = "eso-federated-credential"
+       parent_id           = (known after apply)
+       resource_group_name = "rg-openmrscore-dev"
+       subject             = "system:serviceaccount:eso:workload-identity-sa"
    }

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # azurerm_role_assignment.eso_keyvault_secrets_user will be created
+   resource "azurerm_role_assignment" "eso_keyvault_secrets_user" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets User"
+       scope                            = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.KeyVault/vaults/openmrs-dev-vault"
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.keyvault_secrets_user will be destroyed
  # (because azurerm_role_assignment.keyvault_secrets_user is not in configuration)
-   resource "azurerm_role_assignment" "keyvault_secrets_user" {
-       id                                     = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.KeyVault/vaults/openmrs-dev-vault/providers/Microsoft.Authorization/roleAssignments/dff89ab9-65bb-131b-52ec-b48f8e411b78" -> null
-       name                                   = "dff89ab9-65bb-131b-52ec-b48f8e411b78" -> null
-       principal_id                           = "fbba198e-7ac3-4c6c-8404-bc258039b161" -> null
-       principal_type                         = "ServicePrincipal" -> null
-       role_definition_id                     = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
-       role_definition_name                   = "Key Vault Secrets User" -> null
-       scope                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.KeyVault/vaults/openmrs-dev-vault" -> null
-       skip_service_principal_aad_check       = true -> null
#        (4 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.eso_workload_identity will be created
+   resource "azurerm_user_assigned_identity" "eso_workload_identity" {
+       client_id           = (known after apply)
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "eso-workload-identity"
+       principal_id        = (known after apply)
+       resource_group_name = "rg-openmrscore-dev"
+       tenant_id           = (known after apply)
    }

  # helm_release.oauth2_proxy is tainted, so must be replaced
-/+ resource "helm_release" "oauth2_proxy" {
!~      id                         = "************" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "7.9.0"
-               chart          = "oauth2-proxy"
-               first_deployed = 1747955598
-               last_deployed  = 1747955598
-               name           = "oauth2-proxy"
-               namespace      = "authgate"
-               notes          = <<-EOT
                    CHART NAME: redis
                    CHART VERSION: 21.0.0
                    APP VERSION: 8.0.0
                    
                    Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Redis&reg; can be accessed on the following DNS names from within your cluster:
                    
                        oauth2-proxy-redis-master.authgate.svc.cluster.local for read/write operations (port 6379)
                        oauth2-proxy-redis-replicas.authgate.svc.cluster.local for read-only operations (port 6379)
                    
                    
                    
                    To get your password run:
                    
                        export REDIS_PASSWORD=$(kubectl get secret --namespace authgate oauth2-proxy-redis -o jsonpath="{.data.redis-password}" | base64 -d)
                    
                    To connect to your Redis&reg; server:
                    
                    1. Run a Redis&reg; pod that you can use as a client:
                    
                       kubectl run --namespace authgate redis-client --restart='Never'  --env REDIS_PASSWORD=$REDIS_PASSWORD  --image docker.io/bitnami/redis:8.0.0-debian-12-r0 --command -- sleep infinity
                    
                       Use the following command to attach to the pod:
                    
                       kubectl exec --tty -i redis-client \
                       --namespace authgate -- bash
                    
                    2. Connect using the Redis&reg; CLI:
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-master
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-replicas
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace authgate svc/oauth2-proxy-redis-master 6379:6379 &
                        REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h 127.0.0.1 -p 6379
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - replica.resources
                      - master.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                    
                    To verify that oauth2-proxy has started, run:
                    
                      kubectl --namespace=authgate get pods -l "app=oauth2-proxy"
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       config             = {
-                           existingSecret = "oauth2-proxy-secret"
                        }
-                       extraArgs          = [
-                           "--provider=oidc",
-                           "--oidc-issuer-url=https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0",
-                           "--scope=openid email profile",
-                           "--email-domain=*",
-                           "--redirect-url=https://oauth2.dev.audioprothese.ovh/oauth2/callback",
-                           "--skip-provider-button",
-                           "--reverse-proxy",
-                           "--cookie-secure=true",
-                           "--cookie-domain=.audioprothese.ovh",
-                           "--cookie-name=_oauth2_proxy",
-                           "--cookie-refresh=2m",
-                           "--cookie-expire=24h",
-                           "--whitelist-domain=.audioprothese.ovh",
-                           "--set-authorization-header=false",
-                           "--pass-access-token=false",
-                           "--pass-user-headers=true",
-                           "--set-xauthrequest=true",
-                           "--oidc-email-claim=preferred_username",
                        ]
-                       ingress            = {
-                           annotations = {
-                               "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
-                               "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                            }
-                           className   = "webapprouting.kubernetes.azure.com"
-                           enabled     = true
-                           hosts       = [
-                               "oauth2.dev.audioprothese.ovh",
                            ]
-                           path        = "/oauth2"
-                           pathType    = "Prefix"
-                           tls         = [
-                               {
-                                   hosts      = [
-                                       "oauth2.dev.audioprothese.ovh",
                                    ]
-                                   secretName = "oauth2-tls"
                                },
                            ]
                        }
-                       initContainers     = {
-                           waitForRedis = {
-                               enabled = false
                            }
                        }
-                       proxyVarsAsSecrets = true
-                       redis              = {
-                           enabled = true
                        }
-                       service            = {
-                           portNumber = 4180
-                           type       = "ClusterIP"
                        }
-                       sessionStorage     = {
-                           redis = {
-                               clientType = "standalone"
-                               standalone = {
-                                   connectionUrl = "redis://oauth2-proxy-redis-master:6379/0"
                                }
                            }
-                           type  = "redis"
                        }
                    }
                )
-               version        = "7.12.13"
            },
        ] -> (known after apply)
        name                       = "oauth2-proxy"
!~      status                     = "failed" -> "deployed"
#        (26 unchanged attributes hidden)
    }

  # kubectl_manifest.sa will be updated in-place
!~  resource "kubectl_manifest" "sa" {
        id                      = "/api/v1/namespaces/eso/serviceaccounts/workload-identity-sa"
        name                    = "workload-identity-sa"
!~      yaml_body               = (sensitive value)
!~      yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              annotations:
                azure.workload.identity/client-id: 05d382b8-48ff-4cb3-ad7e-3b7e81cd2e10
              name: workload-identity-sa
              namespace: eso
        EOT -> (known after apply)
!~      yaml_incluster          = (sensitive value)
#        (12 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #172](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15199016391)